app/controllers/admin/categories_controller.rb

  def index
    @categories = Category.paginate(page: params[:page])
---
SELECT  "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    @category = Category.find(params[:id])
    if @category.update_attributes(category_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
UPDATE "categories" SET "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["description", "aiueo kakikukeko sasisuseso tatituteto naninuneno hahihuheho mamimumemo rarirurero yayuyo wawonn"], ["updated_at", "2018-08-31 08:45:58.401185"], ["id", 101]]

  def destroy
    Category.find(params[:id]).destroy
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 102]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 102], ["LIMIT", 1]]