app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"
---
  def index
    @categories = Category.paginate(page: params[:page])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
---
  def destroy
    @category = Category.find(params[:id])