app/views/categories/_category.html.erb

<% if @existing_lesson %>
  <% @count = @existing_lesson.category.words.count %>
---
SELECT COUNT(*) FROM "categories"